# Taps
tap "common-fate/granted"

# ----------------------
# CLI Tools
# ----------------------
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Better ls with icons and git status
brew "fd"           # Better find
brew "fnm"          # Fast Node Manager (replaces nvm)
brew "fzf"          # Fuzzy finder
brew "gh"           # GitHub CLI
brew "git"          # Git version control
brew "git-delta"    # Better git diff
brew "git-lfs"      # Git Large File Storage
brew "jq"           # JSON processor
brew "lazygit"      # Terminal UI for git
brew "stow"         # Symlink farm manager (for dotfiles)
brew "uv"           # Fast Python package manager
brew "zoxide"       # Smarter cd command

# Granted (AWS role switching)
brew "granted"

# ----------------------
# Apps - Productivity
# ----------------------
cask "1password"
cask "1password-cli"
cask "notion"
cask "raycast"
cask "rectangle"
cask "zoom"

# ----------------------
# Apps - Development
# ----------------------
cask "cursor"
cask "datagrip"
cask "docker-desktop"
cask "github"
cask "iterm2"
cask "ngrok"
cask "postman"

# ----------------------
# Apps - AI
# ----------------------
cask "chatgpt"
cask "claude"

# ----------------------
# Apps - Browsers
# ----------------------
cask "google-chrome"
cask "helium-browser"

# ----------------------
# Apps - Utilities
# ----------------------
cask "logi-options+"

# ----------------------
# Fonts
# ----------------------
cask "font-meslo-lg-nerd-font"  # Nerd Font for terminal icons (eza, p10k)

# ----------------------
# VS Code / Cursor Extensions
# ----------------------
# Core
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "eamodio.gitlens"
vscode "mhutchie.git-graph"

# JavaScript/TypeScript
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dsznajder.es7-react-js-snippets"
vscode "drknoxy.eslint-disable-snippets"
vscode "mylesmurphy.prettify-ts"
vscode "yoavbls.pretty-ts-errors"
vscode "pflannery.vscode-versionlens"
vscode "vitest.explorer"

# Web Dev
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "naumovs.color-highlight"
vscode "expo.vscode-expo-tools"

# File Types
vscode "bierner.markdown-checkbox"
vscode "codezombiech.gitignore"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"

# Utilities
vscode "fosshaas.fontsize-shortcuts"
vscode "richie5um2.vscode-sort-json"
vscode "ryu1kn.partial-diff"
vscode "wayou.vscode-todo-highlight"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"

# AI
vscode "anthropic.claude-code"
